Enhancing Cyber Situational Awareness for Cyber-Physical Systems through Digital Twins, Authors : M. Eckhart, A. Ekelhart, E. Weippl
Verification of Large Scale Control Systems with Hybrid Digital Models and Digital Twins, Authors : K. Semenkov, V. Promyslov, A. Poletykin
Quantitative Risk Assessment of Cyber Attacks on Cyber-Physical Systems using Attack Graphs, Authors : I. Semertzis, V. S. Rajkumar, A. Ştefanov, F. Fransen, P. Palensky
MUD-Based Behavioral Profiling Security Framework for Software-Defined IoT Networks, Authors : P. Krishnan, K. Jain, R. Buyya, P. Vijayakumar, A. Nayyar, M. Bilal, H. Song
Industry Engagement for Identification of Cybersecurity Needs Practices for Digital Twins, Authors : K. Alshammari, T. Beach, Y. Rezgui
Digital Twins in Industry 4.0 Cyber Security, Authors : C. Lo, T. Y. Win, Z. Rezaeifar, Z. Khan, P. Legg
Transformation of Factory to Smart Factory, Authors : P. A. Okeme, A. D. Skakun, A. R. Muzalevskii
Advancements in Industrial Cyber-Physical Systems: An Overview and Perspectives, Authors : K. Zhang, Y. Shi, S. Karnouskos, T. Sauter, H. Fang, A. W. Colombo
An Industrial Network Digital Twin for enhanced security of Cyber-Physical Systems, Authors : C. Grasselli, A. Melis, L. Rinieri, D. Berardi, G. Gori, A. A. Sadi
Enhancement in Intelligent Manufacturing through Circular Economy, Authors : D. P. F. Möller
Engineering Education in Intelligent Manufacturing, Authors : D. P. F. Möller, I. A. Jehle, W. Hou
Industrial cyber physical systems: A survey for control-engineering tools, Authors : M. Jbair, B. Ahmad, M. H. Ahmad, R. Harrison
Towards a Novel Framework for Reinforcing Cybersecurity using Digital Twins in IoT-based Healthcare Applications, Authors : S. Pirbhulal, H. Abie, A. Shukla
A Design of Cyber-physical Production System Prototype Based on an Ethereum Private Network, Authors : M. Y. Afanasev, A. A. Krylova, S. A. Shorokhov, Y. V. Fedosov, A. S. Sidorenko
Real-Time Digital Twin of Residential Energy Storage System for Cyber-Security Study, Authors : A. B. Shitole, N. K. Kandasamy, L. S. Liew, L. Sim, A. K. Bui
A Digital Twins Approach to Smart Grid Security Testing and Standardization, Authors : M. Atalay, P. Angin
Improving Resilience in Cyber-Physical Systems based on Transfer Learning, Authors : M. S. Azari, F. Flammini, S. Santini
On the Implementation of IoT-Based Digital Twin for Networked Microgrids Resiliency Against Cyber Attacks, Authors : A. Saad, S. Faddel, T. Youssef, O. A. Mohammed
Towards Cybersecurity of the Smart Grid Using Digital Twins, Authors : J. C. Olivares-Rojas, E. Reyes-Archundia, J. A. Gutiérrez-Gnecchi, I. Molina-Moreno, J. Cerda-Jacobo, A. Méndez-Patiño
A Review of Cybersecurity Guidelines for Manufacturing Factories in Industry 4.0, Authors : V. Mullet, P. Sondi, E. Ramat
A Cyber Digital Twin Framework to Support Cyber-Physical Systems Security, Authors : A. Somma, V. Casola, A. R. Cavalli, A. De Benedictis, W. Mallouli, V. E. Valdés
End-to-end security validation of IoT systems based on digital twins of end-devices, Authors : L. Maillet-Contoz, E. Michel, M. D. Nava, P. -E. Brun, K. Leprêtre, G. Massot
On the Effectiveness of Recurrent Neural Networks for Live Modeling of Cyber-Physical Systems, Authors : S. Yoginath, V. Tansakul, S. Chinthavali, C. Taylor, J. Hambrick, P. Irminger, K. Perumalla
Considerations of Achieving Ubiquitous PNT in Industry 4.0 and Beyond, Authors : M. -K. Olkkonen, M. Kirkko-Jaakkola, S. Kaasalainen
The Facets of Digital Twins in Production and the Automotive Industry, Authors : F. Biesinger, M. Weyrich
Digital Twin-Based Cyber-Attack Detection Framework for Cyber-Physical Manufacturing Systems, Authors : E. C. Balta, M. Pease, J. Moyne, K. Barton, D. M. Tilbury
Design & Development of Virtual Reality Empowered Cyber-Security Training Testbed for IoT Systems, Authors : N. D. Chandrashekar, K. King, D. Gračanin, M. Azab
A Smart Digital Twin Enabled Security Framework for Vehicle-to-Grid Cyber-Physical Systems, Authors : M. Ali, G. Kaddoum, W. -T. Li, C. Yuen, M. Tariq, H. V. Poor
Cyber Security Issues in the Industrial Applications of Digital Twins, Authors : S. Siddique, M. A. Haque, R. H. Rifat, R. George, K. Shujaee, K. D. Gupta
Security Analysis of a Digital Twin Framework Using Probabilistic Model Checking, Authors : E. Shaikh, A. R. Al-Ali, S. Muhammad, N. Mohammad, F. Aloul
Securing IoT Device Networks: A Digital Twin and Automated Adversary Emulation Approach, Authors : E. W. van der Wal, M. El-Hajj
IoT Standardization Strategies in ISO/IEC JTC 1/SC 41, Authors : F. Coallier
Building Human Digital Twins: Cases for Intelligence and Security Informatics, Authors : W. Chung
Secure Transmission Scheme for Smart Grid CPS with Digital Twin Architecture Based on Multi-Agent DRL, Authors : G. Lian
The Future of the Internet of Things (IoT) and IoT Authentication, Authors : P. Maity, K. Sur, I. Muhopadhyay
Compliance Control of Parameters During Machining on CNC Equipment Using Industrial IoT and Digital Twin, Authors : S. Sokolov, O. Morozova, V. Kharchenko, A. Tetskyi
Skilled Agricultural Task Delivery by a Digital Twin, Authors : V. G. Kaburlasos, C. Lytridis, G. Siavalas, V. N. Tsakalidou, C. Tsakmakis, I. Kalathas, T. Pachidis, K. Rantos, K. Kalaboukas
CyberFactory#1 — Securing the industry 4.0 with cyber-ranges and digital twins, Authors : A. Bécue, Y. Fourastier, I. Praça, A. Savarit, C. Baron, B. Gradussofs, E. Pouille, C. Thomas
Data Processing in Industrial Internet of Things (IIoT) Applications : Industrial Agility, Authors : M. B. Sergeeva, V. V. Voskobovich, A. M. Kukharenko
Digital Twin: A Comprehensive Survey of Security Threats, Authors : C. Alcaraz, J. Lopez
Digital Twins and the Future of Their Use Enabling Shift Left and Shift Right Cybersecurity Operations, Authors : A. Mohsin, H. Janicke, S. Nepal, D. Holmes
Combination of Digital Twin and Artificial Intelligence in Manufacturing Using Industrial IoT, Authors : V. Kharchenko, O. Illiashenko, O. Morozova, S. Sokolov
Securing Networks of IoT Devices With Digital Twins and Automated Adversary Emulation, Authors : E. W. van der Wal, M. El-Hajj
A Probabilistic Model Checking (PMC) Approach to Solve Security Issues in Digital Twin (DT), Authors : E. Shaikh, N. Mohammad, A. Al-Ali, S. Muhammad
VAC: A Software Approach to Resilient SCADA Automation, Authors : J. Johnson, B. Weber, J. Smith, C. Hathhorn, P. Irminger, S. Norem, J. Guerra, J. Dawson, T. McDaniel
Industry 4.0 and its Technologies: A Systematic Literature Review, Authors : E. A. Alaref, S. A. Khan
The Internet of Things in the Oil and Gas Industry: A Systematic Review, Authors : T. R. Wanasinghe, R. G. Gosine, L. A. James, G. K. I. Mann, O. de Silva, P. J. Warrian
Enhancing Industrial Cyber-Physical Systems Security with Smart Probing Approach, Authors : V. Bonagura, C. Foglietta, S. Panzieri, F. Pascucci
Digital-Twin-Based CPS Anomaly Diagnosis and Security Defense Countermeasure Recommendation, Authors : J. Ma, Y. Guo, C. Fang, Q. Zhang
Standardization: A Key Factor of Industry 4.0, Authors : N. Velásquez Villagrán, E. Estevez, P. Pesado, J. De Juanes Marquez
IoT, 6G and Digital Twin For Smart Campus, Authors : T. Pexyean, K. Saraubon, P. Nilsook
Cybersecurity Challenges in Electric Vehicles: An initial literature review and research agenda, Authors : G. R. Euceda, A. Akundi, S. Luna
Delivering on Industry 4.0 in a multinational petrochemical company: Design and execution, Authors : E. A. Buhulaiga, A. Telukdarie, S. J. Ramsangar
Digital Twins Serving Cybersecurity: More Than a Model: Cybersecurity as a Future Benefit of Digital Twins 2, Authors : A. Srivastava, C. -C. Liu, A. Stefanov, S. Basumallik, M. M. Hussain, B. Somda, V. S. Rajkumar
Analysis of Cyber-Attacks for Modern Digital Railway System Using Cyber Range, Authors : G. Sharma, E. Sherif, M. He, E. Boiten
Digital Twins for Industrial Control Systems Security, Authors : G. Francia, G. Hall
Hybrid Digital Twin Architecture for Power System Cyber Security Analysis, Authors : V. Ayyalusamy, B. Sivaneasan, N. Kandasamy, J. F. Xiao, A. K, A. Chandra
Privacy and Security Issues for Human Digital Twins, Authors : G. Sirigu, B. Carminati, E. Ferrari
Resource-Constrained EXtended Reality Operated With Digital Twin in Industrial Internet of Things, Authors : H. M. Kamdjou, D. Baudry, V. Havard, S. Ouchani
Review of the State-of-the-Art of ERP 4.0 Systems, Authors : H. Rathnayake, L. Vimukthi, M. Gamage, R. Wickramaarachchi, A. Withanaarachchi
A Digital Twin for Enhanced Cybersecurity in Connected Vehicles, Authors : C. Grasselli, A. Melis, R. Girau, F. Callegati
Attribute-Based Access Control for AWS Internet of Things and Secure Industries of the Future, Authors : S. Bhatt, T. K. Pham, M. Gupta, J. Benson, J. Park, R. Sandhu
Environment for Education on Industry 4.0, Authors : J. J. Fuertes, M. Á. Prada, J. R. Rodríguez-Ossorio, R. González-Herbón, D. Pérez, M. Domínguez
Threat intelligence using Digital Twin honeypots in Cybersecurity, Authors : M. Nintsiou, E. Grigoriou, P. A. Karypidis, T. Saoulidis, E. Fountoukidis, P. Sarigiannidis
Cyber Security Risk Analysis of Physical Protection Systems of Nuclear Power Plants and Research on the Cyber Security Test Platform Using Digital Twin Technology, Authors : Y. Guo, A. Yan, J. Wang
A Review on Blockchain Technologies for an Advanced and Cyber-Resilient Automotive Industry, Authors : P. Fraga-Lamas, T. M. Fernández-Caramés
Real-Time Cyber-Physical Analysis of Distribution Systems Using Digital Twins, Authors : M. M. Siraj Khan, J. Giraldo, M. Parvania
Healthcare Internet of Things: Security Threats, Challenges, and Future Research Directions, Authors : M. Adil, M. K. Khan, N. Kumar, M. Attique, A. Farouk, M. Guizani, Z. Jin
Enhancing Operational Resilience of Critical Infrastructure Processes Through Chaos Engineering, Authors : P. Dedousis, G. Stergiopoulos, G. Arampatzis, D. Gritzalis
IoT Platform Based on Digital Twin Modeling and Multi-Source Information Fusion, Authors : J. Gu
Cyber-Physical System Security Surveillance using Knowledge Graph based Digital Twins - A Smart Farming Usecase, Authors : S. S. L. Chukkapalli, N. Pillai, S. Mittal, A. Joshi
Cyber Security Standards for the Industrial Internet of Things (IIoT)– A Systematic Review, Authors : A. Buja, M. Apostolova, A. Luma, Y. Januzaj
Platforms for industrial cyber-physical systems integration: contradicting requirements as drivers for innovation, Authors : M. Heiss, A. Oertl, M. Sturm, P. Palensky, S. Vielguth, F. Nadler
Internet of Things: Security Threats and Proposed Solutions, Authors : A. S. Ahmed, S. KURNAZ
Application of Industry 4.0 trends in the teaching process, Authors : J. Brazina, V. Stepanek, M. Holub, J. Vetiska, F. Bradac
The Future of IoT, Authors : J. Ploennigs, J. Cohn, A. Stanford-Clark
Effects of Adopting Industry 4.0 on a Manufacturing Plant, Authors : P. Waghanna, A. Reddy, S. Deshpande, S. Chavan, V. R. Jaiswal, V. Naranje
Cyber-physical data stream assessment incorporating Digital Twins in future power systems, Authors : A. Kummerow, C. Monsalve, D. Rösch, K. Schäfer, S. Nicolai
Uncertainty Decision Modeling Approach for Control Engineering Tools to Support Industrial Cyber-Physical Metaverse Smart Manufacturing Systems, Authors : A. A. Zaidan, H. A. Alsattar, S. Qahtan, M. Deveci, D. Pamucar, M. Hajiaghaei-Keshteli
Industry 4.0 and Sustainability in Through Life Smart Manufacturing, Authors : S. A. Sabu, C. Thomas
Digital Twins and Cyber Security – solution or challenge?, Authors : D. Holmes, M. Papathanasaki, L. Maglaras, M. A. Ferrag, S. Nepal, H. Janicke
The Potential of Digital Twins, Authors : A. El Saddik, F. Laamarti, M. Alja'Afreh
Fortifying Federated Learning in IIoT: Leveraging Blockchain and Digital Twin Innovations for Enhanced Security and Resilience, Authors : S. B. Prathiba, Y. Govindarajan, V. Pranav Amirtha Ganesan, A. Ramachandran, A. K. Selvaraj, A. Kashif Bashir, T. Reddy Gadekallu
Digital Twin-Enhanced Methodology for Training Edge-Based Models for Cyber Security Applications, Authors : D. Allison, P. Smith, K. McLaughlin
Digital Twin Management Systems – challenges, application, development, Authors : I. Stankov, V. Stefanova-Stoyanova
Challenges in the Co-assurance of Functional Safety and Cybersecurity in Industry 4.0, Authors : S. Ramachandra, J. Vankeirsbilck, J. Boydens
Decisioning-Based Approach for Optimising Control Engineering Tools Using Digital Twin Capabilities and Other Cyber-Physical Metaverse Manufacturing System Components, Authors : N. Mourad, H. A. Alsattar, S. Qahtan, A. A. Zaidan, M. Deveci, A. K. Sangaiah, W. Pedrycz
Mission-Oriented Security Framework: An Approach to Embrace Cyber Resilience in Design and Action, Authors : X. Xiong, Q. Yao, Q. Ren
Using Digital Twin Data for the Attribute-Based Usage Control of Value-Added Networks, Authors : A. Kern, R. Anderl
Over-the-Air Software Updates in the Internet of Things: An Overview of Key Principles, Authors : J. Bauwens, P. Ruckebusch, S. Giannoulis, I. Moerman, E. D. Poorter
Resilience learning through self adaptation in digital twins of human-cyber-physical systems, Authors : E. Bellini, F. Bagnoli, M. Caporuscio, E. Damiani, F. Flammini, I. Linkov, P. Liò, S. Marrone
A Digital Twin System for Monitoring the Security of Theatrical Stages, Authors : Q. Li, D. Huo, L. Jiang
Identity Threats in the Metaverse and Future Research Opportunities, Authors : A. M. Awadallah, E. Damiani, J. Zemerly, C. Y. Yeun
Real-time, Simulation-based Identification of Cyber-Security Attacks of Industrial Plants, Authors : A. Patel, T. Schenk, S. Knorn, H. Patzlaff, D. Obradovic, A. B. Halblaub
Security-Enhancing Digital Twins: Characteristics, Indicators, and Future Perspectives, Authors : M. Eckhart, A. Ekelhart, D. Allison, M. Almgren, K. Ceesay-Seitz, H. Janicke, S. Nadjm-Tehrani, A. Rashid, M. Yampolskiy
A Systematic Survey of Industrial Internet of Things Security: Requirements and Fog Computing Opportunities, Authors : K. Tange, M. De Donno, X. Fafoutis, N. Dragoni
Convergent Access Control to Enable Secure Smart Communities, Authors : S. Bhatt, R. Sandhu
Digital Twin-Empowered Smart Attack Detection System for 6G Edge of Things Networks, Authors : Y. Yigit, C. Chrysoulas, G. Yurdakul, L. Maglaras, B. Canberk
Blockchain-Secured Smart Manufacturing in Industry 4.0: A Survey, Authors : J. Leng, S. Ye, M. Zhou, J. L. Zhao, Q. Liu, W. Guo, W. Cao, L. Fu
Concept, Key Technologies and Challenges of Digital Twin Riverbasin, Authors : L. Wenzheng, Z. Yifeng
Risk Assessment for Digitalization of Facilities of Cyber-Physical Energy System, Authors : L. Gurina, T. Zoryna, N. Tomin
TwinPot: Digital Twin-assisted Honeypot for Cyber-Secure Smart Seaports, Authors : Y. Yigit, O. K. Kinaci, T. Q. Duong, B. Canberk
“Industrie 4.0” and Smart Manufacturing: A State of the Art Review, Authors : A. T. Hassan, L. A. H. Al-Kindi, A. B. Abdulghafour
Design and typical application of digital twin architecture in Smart Grid, Authors : B. Gao, H. Liu, H. Su, Z. Hong, C. Ji, M. Zhao
Research and Innovation In Next Generation Security and Privacy In Industry 5.0 Iot, Authors : G. S. Navale, R. Madala, M. Managuli, N. Jayalakshmi, G. Kadiravan, R. Rawat
INSpIRA: INtegrating Security Into Risk Assessment, Authors : J. Dobaj
Edge Centric Secure Data Sharing with Digital Twins in Smart Ecosystems, Authors : G. Cathey, J. Benson, M. Gupta, R. Sandhu
Challenges of Digital Twin Application in Manufacturing, Authors : C. Kober, M. Fette, J. P. Wulfsberg
Evolving the Ecosystem: Eclipse Arrowhead integrates Eclipse IoT, Authors : J. Kristan, P. Azzoni, L. Römer, S. E. Jeroschewski, E. Londero
A Vision of Intelligent IoT — Trends, Characteristics and Functional Architecture, Authors : Y. Li, W. Chen, Y. Ding, Y. Qie, C. Zhang
IoTFuzz: Automated Discovery of Violations in Smart Homes With Real Environment, Authors : X. Ban, M. Ding, S. Liu, C. Chen, J. Zhang
Assessment of a Method for Detecting Process Anomalies Using Digital-Twinning, Authors : G. Sugumar, A. Mathur
The Design of Cyber-Physical Exercises (CPXS), Authors : S. Shrivastava, F. Furtado, M. Goh, A. Mathur
Design of a six-layer data architecture based on OT/IT convergence in the context of Industry 4.0, Authors : K. Fakir, C. Ennawaoui, M. El Mouden
A Smart Factory Architecture Based on Industry 4.0 Technologies: Open-Source Software Implementation, Authors : J. A. Fortoul-Diaz, L. A. Carrillo-Martinez, A. Centeno-Tellez, F. Cortes-Santacruz, I. Olmos-Pineda, R. R. Flores-Quintero
Adaptive Federated Learning for Digital Twin Driven Industrial Internet of Things, Authors : Q. Song, S. Lei, W. Sun, Y. Zhang
Zero Trust Avionics Systems (ZTAS), Authors : T. Khamvilai, M. Pakmehr
Deep Learning Driven Security in Digital Twins of Drone Network, Authors : J. Wu, J. Guo, Z. Lv
A Decentralized Resource Allocation in Edge Computing for Secure IoT Environments, Authors : A. Sasikumar, L. Ravi, M. Devarajan, S. Vairavasundaram, A. Selvalakshmi, K. Kotecha, A. Abraham
Cyber Security Risks of Net Zero Technologies, Authors : H. Yuan, S. Li
Enabling civil-military information sharing in federated smart environments, Authors : K. Kanciak, M. Jarosz, P. Głębocki, K. Wrona
SoK: A Holistic View of Cyberattacks Prediction with Digital Twins, Authors : J. Luzzi, R. Naha, A. Arulappan, A. Mahanti
Human-Collaborative Artificial Intelligence Along With Social Values in Industry 5.0: A Survey of the State-of-the-Art, Authors : M. Khosravy, N. Gupta, A. Pasquali, N. Dey, R. G. Crespo, O. Witkowski
Securing the Smart Grid: A Review on Digital Twins for Cyber Resilience, Authors : K. Anto, F. Marattukalam, P. S. Roop, A. K. Swain
Realising the vision of digital twins: Challenges in trustworthiness, Authors : K. Reeves, C. Maple
Impact and Vulnerability Analysis of IEC61850 in Smartgrids Using Multiple HIL Real-Time Testbeds, Authors : M. Hemmati, M. H. Palahalli, G. Storti Gajani, G. Gruosso
ANGEL: An Intelligent Digital Twin Framework for Microgrid Security, Authors : W. Danilczyk, Y. Sun, H. He
Aspects of Nuclear Power Plant Digital Decommissioning, Authors : E. Jharko, R. Meshcheryakov, V. Promyslov
Digital Twin-Based Cyber Range for Industrial Internet of Things, Authors : H. Zhou, M. Li, Y. Sun, L. Yun, Z. Tian
The SAir-IIoT Cyber Testbed as a Service: A Novel Cybertwins Architecture in IIoT-Based Smart Airports, Authors : N. Koroniotis, N. Moustafa, F. Schiliro, P. Gauravaram, H. Janicke
LSTM-Based Detection of OT Cyber-Attacks for an Offshore HVAC-Cooling Process, Authors : L. S. Ramos, Z. Yang
Digital Twin and Ontology based DDoS Attack Detection in a Smart-Factory 4.0, Authors : V. V. Gowripeddi, S. GVK, J. Bapat, D. Das
Blockchain Checksum for Establishing Secure Communications for Digital Twin Technology, Authors : W. Danilczyk, Y. L. Sun, H. He
Digital Twins in Industrial IoT: a survey of the state of the art and of relevant standards, Authors : M. Vuković, D. Mazzei, S. Chessa, G. Fantoni
A DDoS Attack Detection System for Industry 5.0 using Digital Twins and Machine Learning, Authors : A. Gaurav, B. B. Gupta, K. Tai Chui, V. Arya, E. Benkhelifa
Digital Twins: Shaping the Future of Energy Systems and Smart Cities through Cybersecurity, Efficiency, and Sustainability, Authors : U. Cali, B. D. Dimd, P. Hajialigol, A. Moazami, S. N. G. Gourisetti, G. Lobaccaro, M. Aghaei
Digital Twin for Evaluating Detective Countermeasures in Smart Grid Cybersecurity, Authors : Ö. Sen, N. Bleser, A. Ulbig
Cybersecurity as Information Retrieval Dimension for Cloud-based Edge-powered IoT Search, Authors : C. Manta-Caro, J. M. Fernández-Luna, W. J. Fernández
Management of Digital Twin-Driven IoT Using Federated Learning, Authors : S. AbdulRahman, S. Otoum, O. Bouachir, A. Mourad
Towards 5G-Enabled Operational Technology for Process Monitoring and Network Slicing, Authors : J. M. Aguayo, A. O. G. Rivera, D. K. Tosh
Incentive-Based Federated Learning for Digital-Twin-Driven Industrial Mobile Crowdsensing, Authors : B. Li, Y. Shi, Q. Kong, Q. Du, R. Lu
Analogous Analogues: Digital Twins and Hardware Tracking in GLAM Collections, Authors : D. M. Ross, E. Cretu, V. Lemieux
Poisoning Attacks in Federated Edge Learning for Digital Twin 6G-Enabled IoTs: An Anticipatory Study, Authors : M. A. Ferrag, B. Kantarci, L. C. Cordeiro, M. Debbah, K. -K. R. Choo
Enhancing Cybersecurity Training Efficacy: A Comprehensive Analysis of Gamified Learning, Behavioral Strategies and Digital Twins, Authors : Y. Yigit, K. Kioskli, L. Bishop, N. Chouliaras, L. Maglaras, H. Janicke
Immersive Virtual Reality for Virtual and Digital Twins: A Literature Review to Identify State Of The Art and Perspectives, Authors : J. Pirker, E. Loria, S. Safikhani, A. Künz, S. Rosmann
Blockchain as a Cyber Defense: Opportunities, Applications, and Challenges, Authors : S. Lee, S. Kim
Challenges in providing sustainable analytic of system of systems with long life time, Authors : D. Hallmans, K. Sandström, S. Larsson, T. Nolte
Federated Continuous Learning Based on Stacked Broad Learning System Assisted by Digital Twin Networks: An Incremental Learning Approach for Intrusion Detection in UAV Networks, Authors : X. He, Q. Chen, L. Tang, W. Wang, T. Liu, L. Li, Q. Liu, J. Luo
Digital Twin of Road and Bridge Construction Monitoring and Maintenance, Authors : F. Hidayat, S. H. Supangkat, K. Hanafi
Dynamic Rerouting of Cyber-Physical Production Systems in Response to Disruptions Based on SDC Framework, Authors : Y. Qamsane, E. C. Balta, J. Moyne, D. Tilbury, K. Barton
DT4I4-Secure: Digital Twin Framework for Industry 4.0 Systems Security, Authors : Y. -Z. Lin, S. Shao, M. H. Rahman, M. Shafae, P. Satam
Adaptive Federated Learning and Digital Twin for Industrial Internet of Things, Authors : W. Sun, S. Lei, L. Wang, Z. Liu, Y. Zhang
Conceptual Study of Artificial Intelligence in Smart Cities with Industry 4.0, Authors : S. S. Kumar, A. Sudhir Bale, P. M. Matapati, V. N
Modelling and automatic mapping of cyber security requirements for industrial applications: Survey, problem exposition, and research focus, Authors : M. Ehrlich, L. Wisniewski, H. Trsek, J. Jasperneite
Digitalization in Power Energy Sector: Principles of Cybersecurity, Authors : V. Timčenko, S. B. Rakas, M. Kabović, A. Kabović
User Group Behavioural Pattern in a Cellular Mobile Network for 5G Use-cases, Authors : G. Soós, D. Ficzere, P. Varga
Digital Twins and 5G: Unlocking the Potential in the Energy Sector, Authors : M. Maksimović, S. Jokić, M. Č. Bošković
Consumer Frameworks for Smart Environments, Authors : S. Chakrabarty, D. W. Engels, L. Wood
ACPS: Design of an Integrated Architecture for Airborne System and Cyber-Physical System, Authors : Z. Wu, R. Dong
Digital Twins in Industry 5.0: Challenges in Modeling and Communication, Authors : M. Balogh, A. Földvári, P. Varga
Solution Approaches from Industry for Flightline of the Future and Next Generation Test Systems, Authors : M. Dziuk, L. Edinburgh, S. Reynolds, J. Rousseau, J. B. Winn
RL-Based Federated Learning Framework Over Blockchain (RL-FL-BC), Authors : A. Riahi, A. Mohamed, A. Erbad
Harnessing the Power of Cloud-Based Technology to Foster an Integrated and Dynamic Platform for Sharing Threat Intelligence, thereby Strengthening Collective Defenses against Emerging Cybersecurity Risks, Authors : S. Prabha, R. Tharani, R. C. Yogitaadevi, K. Sowndarya
Research and Application of CPS-Based Automatic Circulation System for the Entire Silk Production Process, Authors : Y. Zhang, Z. Song, X. Lan, L. Song, Y. Li, H. Feng
Synergies of Operation, Information, and Communication Technology for Solving New Societal and Industrial Challenges: Future Directions, Authors : W. Dai, P. Leitão, K. F. Tsang, Y. Shi, G. Hancke, L. Shu, M. Behnam, J. Haase, V. Vyatkin
Adaptive Digital Twin Placement and Transfer in Wireless Computing Power Network, Authors : Y. Zhang, H. Zhang, Y. Lu, W. Sun, L. Wei, Y. Zhang, B. Wang
UAV-Assisted IoT Applications, Cybersecurity Threats, AI-Enabled Solutions, Open Challenges With Future Research Directions, Authors : M. Adil, H. Song, S. Mastorakis, H. Abulkasim, A. Farouk, Z. Jin
Trust in Sociotechnical Systems: The Case of Aluminum Packaging Process, Authors : F. Jauernig, M. Falaleyeva, S. Cevani, M. Hrabovec, D. Matveev, M. Iqbal, S. Suhail
Real-Time Cyber Attack Localization in Distribution Systems Using Digital Twin Reference Model, Authors : M. M. S. Khan, J. Giraldo, M. Parvania
Protecting Modbus/TCP-Based Industrial Automation and Control Systems Using Message Authentication Codes, Authors : F. Katulić, D. Sumina, S. Groš, I. Erceg
Cyber Physical Systems: From Information Society to Super Smart Society, Authors : T. Yıldırım
Digital Twins for Intelligent Authorization in the B5G-Enabled Smart Grid, Authors : J. Lopez, J. E. Rubio, C. Alcaraz
A Detailed Analysis of Qualitative and Quantitative Factors in Realization of 6G Communication, Authors : M. Alja’Afreh, A. Karime, S. Alouneh, A. El Saddik
Recent Technological Progress to Empower Smart Manufacturing: Review and Potential Guidelines, Authors : K. Haricha, A. Khiat, Y. Issaoui, A. Bahnasse, H. Ouajji
Metaverse for Healthcare: A Survey on Potential Applications, Challenges and Future Directions, Authors : R. Chengoden, N. Victor, T. Huynh-The, G. Yenduri, R. H. Jhaveri, M. Alazab, S. Bhattacharya, P. Hegde, P. K. R. Maddikunta, T. R. Gadekallu
Industry 4.0 Solutions Impacts on Critical Infrastructure Safety and Protection–A Systematic Literature Review, Authors : M. Wisniewski, B. Gladysz, K. Ejsmont, A. Wodecki, T. Van Erp
Data Risks Identification in Healthcare Sensor Networks, Authors : K. Lopatina, V. A. Dokuchaev, V. V. Maklachkova
Toward Smart Manufacturing Using Spiral Digital Twin Framework and Twinchain, Authors : A. Khan, F. Shahid, C. Maple, A. Ahmad, G. Jeon
RIPOSTE: A Collaborative Cyber Attack Response Framework for Automotive Systems, Authors : R. Jolak, T. Rosenstatter, S. Aldaghistani, R. Scandariato
Attack Detection in Power Distribution Systems Using a Cyber-Physical Real-Time Reference Model, Authors : M. M. S. Khan, J. A. Giraldo, M. Parvania
Innovative Cyber Security Solutions Built on Block chain Technology for Industrial 5.0 Applications, Authors : K. K. Ramachandran, B. Nagarjuna, S. V. Akram, J. Bhalani, A. M. Raju, R. Ponnusamy
Towards Trustworthy Autonomous Systems: Taxonomies and Future Perspectives, Authors : F. Flammini, C. Alcaraz, E. Bellini, S. Marrone, J. Lopez, A. Bondavalli
Data Quality in Human-Centric Sensing-Based Next-Generation IoT Systems: A Comprehensive Survey of Models, Issues, and Challenges, Authors : K. Banti, M. Louta, P. Baziana
Security of Cloud-Assisted BANs Using Digital Twin, Authors : N. U. Sama, K. Zen, A. Ud Din, N. Azim, A. Ur Rahman
DDoS Attack Detection Through Digital Twin Technique in Metaverse, Authors : B. B. Gupta, A. Gaurav, K. T. Chui, L. Wang, V. Arya, A. Shukla, D. Peraković
Lightweight Digital Twin and Federated Learning With Distributed Incentive in Air-Ground 6G Networks, Authors : W. Sun, S. Lian, H. Zhang, Y. Zhang
Roles of Blockchain in the Metaverse: Concepts, Taxonomy, Recent Advances, Enabling Technologies, and Open Research Issues, Authors : M. Elsadig, M. A. Alohali, A. O. Ibrahim, A. W. Abulfaraj
Cyber Security Threats for 5G Networks, Authors : J. P. Mohan, N. Sugunaraj, P. Ranganathan
A Digital Twin for the 5G Era: the SPIDER Cyber Range, Authors : F. Rebecchi, A. Pastor, A. Mozo, C. Lombardo, R. Bruschi, I. Aliferis, R. Doriguzzi-Corin, P. Gouvas, A. Alvarez Romero, A. Angelogianni, I. Politis, C. Xenakis
MTComm Based Virtualization and Integration of Physical Machine Operations with Digital-Twins in Cyber-Physical Manufacturing Cloud, Authors : M. R. Shahriar, S. M. N. A. Sunny, X. Liu, M. C. Leu, L. Hu, N. -T. Nguyen
Security Aspects of Communications in VANETs, Authors : S. Mihai, N. Dokuz, M. S. Ali, P. Shah, R. Trestian
Digital Twin Analysis to Promote Safety and Security in Autonomous Vehicles, Authors : S. Almeaibed, S. Al-Rubaye, A. Tsourdos, N. P. Avdelidis
Study on the Reference Architecture and Assessment Framework of Industrial Internet Platform, Authors : J. Li, J. -J. Qiu, Y. Zhou, S. Wen, K. -Q. Dou, Q. Li
Next Generation Financial Services: Role of Blockchain enabled Federated Learning and Metaverse, Authors : P. Chatterjee, D. Das, D. B. Rawat
Digital Twin Satellite Networks Toward 6G: Motivations, Challenges, and Future Perspectives, Authors : B. Mao, X. Zhou, J. Liu, N. Kato
Grand Challenge: Applying Artificial Intelligence and Machine Learning to Cybersecurity, Authors : K. Bresniker, A. Gavrilovska, J. Holt, D. Milojicic, T. Tran
Synchronized Provable Data Possession Based on Blockchain for Digital Twin, Authors : T. Li, H. Wang, D. He, J. Yu
Change Management using Generative Modeling on Digital Twins, Authors : N. Das, A. Kotal, D. Roseberry, A. Joshi
The Role of Cyber Threat Intelligence Sharing in the Metaverse, Authors : K. Dunnett, S. Pal, Z. Jadidi, R. Jurdak
Prototyping a Digital Twin for Real Time Remote Control Over Mobile Networks: Application of Remote Surgery, Authors : H. Laaki, Y. Miche, K. Tammi
Analysis of the Application of Artificial Intelligence Technology in the Construction of Smart Campus, Authors : W. Liang
Design and Implementation of the Substation Intelligent Auxiliary Control System Based on OPC UA, Authors : C. Zhu, B. Li, Z. Lv, X. Zhao
FedGPS: Personalized Cross-Silo Federated Learning for Internet of Things-enabled Predictive Maintenance, Authors : Y. Jiang, C. Ji
Digital Twin-Aided Orchestration of Mobile Edge Computing With Grant-Free Access, Authors : N. A. Mitsiou, V. K. Papanikolaou, P. D. Diamantoulakis, T. Q. Duong, G. K. Karagiannidis
Using Digital Twin to Detect Cyber-Attacks in Industrial Control Systems, Authors : J. Pisani, G. Cavone, F. Pascucci, L. Giarré
Challenges and opportunities for phasor data based event detection in transmission control centers under cyber security constraints, Authors : A. Kummerow, D. Rösch, C. Monsalve, S. Nicolai, P. Bretschneider, C. Brosinsky, D. Westermann
Security and Privacy on 6G Network Edge: A Survey, Authors : B. Mao, J. Liu, Y. Wu, N. Kato
Security through Digital Twin-Based Intrusion Detection: A SWaT Dataset Analysis, Authors : M. Bozdal
Industrial Control Systems attack detection by hybrid digital twin, Authors : J. Pisani, G. Cavone, L. Giarré, F. Pascucci
A Survey on the Security in Cyber Physical System with Multi-Factor Authentication, Authors : M. Sain, O. Normurodov, C. Hong, K. L. Hui
A Survey on the Security in Cyber Physical System with Multi-Factor Authentication, Authors : M. Sain, O. Normurodov, C. Hong, K. L. Hui
Intelligent Task Offloading and Resource Allocation in Digital Twin Based Aerial Computing Networks, Authors : H. Guo, X. Zhou, J. Wang, J. Liu, A. Benslimane
VIR2EM: VIrtualization and Remotization for Resilient and Efficient Manufacturing: Project-Dissemination Paper, Authors : A. Beghi, N. Dall'Ora, D. Dalle Pezze, F. Fummi, C. Masiero, S. Spellini, G. A. Susto, F. Tosoni
Detecting and Preventing Faked Mixed Reality, Authors : F. Kilger, A. Kabil, V. Tippmann, G. Klinker, M. -O. Pahl
Next-generation enterprise architectures: Common vernacular and evolution towards service-orientation, Authors : M. Moghaddam, C. R. Kenley, J. M. Colby, M. N. Cadavid Berns, R. Rausch, J. Markham, W. M. Skeffington, J. Garrity, A. R. Chaturvedi, A. V. Deshmukh
HArMoNICS: High-Assurance Microgrid Network Infrastructure Case Study, Authors : G. Roascio, G. Costa, E. Baccelli, L. Malina, R. Matulevičius, M. Momeu, N. Morkevičius, E. Russo, B. Stojanović, A. Tasidou
Blockchain-enabled Digital Twin Technology for Next-Generation Transportation Systems, Authors : S. Banerjee, D. Das, P. Chatterjee, U. Ghosh
Intrusion Detection in Binary Process Data: Introducing the Hamming-distance to Matrix Profiles, Authors : S. D. D. Anton, H. D. Schotten
Secure and Privacy-preserving Data-sharing Framework based on Blockchain Technology for Al-Najaf/Iraq Oil Refinery, Authors : S. M. Umran, S. Lu, Z. A. Abduljabbar, Z. Lu, B. Feng, L. Zheng
Real Time Electrical Transient Analyzer Program (ETAP RT) Improvement for Gas Processing & Utilities (GPU) plant, PETRONAS Gas Berhad, Authors : N. M. F. B. Nordzi, I. A. B. C. A. Rahman, I. M. H. K. Baharaini, I. M. R. B. M. Tahir
Research on Quality Prediction of Optical Modules in 5G Networks, Authors : B. Li, H. Liu, G. Liu, W. Sun, L. Xu, T. Xiao, Y. Li, X. Zhu, Y. Zheng, Q. Chen
Towards a Mixed Virtual Reality Environment Implementation to Enable Industrial Robot Programming Competencies within a Cyber-Physical Factory, Authors : C. Vázquez-Hurtado, E. Altamirano-Avila, A. Roman-Flores, A. Vargas-Martinez
Cybersecurity Threats, Vulnerabilities, Mitigation Measures in Industrial Control and Automation Systems: A Technical Review, Authors : A. Ocaka, D. Ó. Briain, S. Davy, K. Barrett
Dynamic Digital Twin and Distributed Incentives for Resource Allocation in Aerial-Assisted Internet of Vehicles, Authors : W. Sun, P. Wang, N. Xu, G. Wang, Y. Zhang
Real-Time Task Scheduling for Digital Twin Edge Network, Authors : C. Kim, M. Chehimi, M. Jung, W. Saad
A Smart-Farming Ontology for Attribute Based Access Control, Authors : S. S. L. Chukkapalli, A. Piplai, S. Mittal, M. Gupta, A. Joshi
Digital Twin and Artificial Intelligence-Empowered Panoramic Video Streaming: Reducing Transmission Latency in the Extended Reality-Assisted Vehicular Metaverse, Authors : S. Li, X. Lin, J. Wu, W. Zhang, J. Li
A Roadmap Towards the Smart Factory, Authors : A. T. Sufian, B. M. Abdullah, M. Ateeq, R. Wah, D. Clements
Neuro-Symbolic Explainable Artificial Intelligence Twin for Zero-Touch IoE in Wireless Network, Authors : M. S. Munir, K. T. Kim, A. Adhikary, W. Saad, S. Shetty, S. -B. Park, C. S. Hong
Digital Twin for the Oil and Gas Industry: Overview, Research Trends, Opportunities, and Challenges, Authors : T. R. Wanasinghe, L. Wroblewski, B. K. Petersen, R. G. Gosine, L. A. James, O. De Silva, G. K. I. Mann, P. J. Warrian
Smart Supply Chain Management and Big Data Analysis Using Machine Learning in Industry 4.0, Authors : S. Kediya, R. Santhanam, R. A. Kayande, A. Sharma, Y. Sure, V. Disawal
Intelligent Systems and Methods for Smart City in Multiple Domains, Authors : J. A. P, A. Shankar, A. Shukla, A. N. J. R, S. S. Kumar, Y. A
Merging Model-Based and Data-Driven Approaches for Resilient Systems Digital Twins Design, Authors : L. Campanile, M. S. de Biase, R. De Fazio, M. Di Giovanni, F. Marulli, L. Verde
Some Aspects of Creation of Flexible Modeling Software Package for NPP, Authors : E. Jharko
Ontology-Based Cybersecurity for Well-Being, Aging and Health: A Scoping Review, Authors : H. Belani, P. Šolić, T. Perković, K. Zovko
Multisource Heterogeneous Specific Emitter Identification Using Attention Mechanism-Based RFF Fusion Method, Authors : Y. Zhang, Q. Zhang, H. Zhao, Y. Lin, G. Gui, H. Sari
A Review on Digital Twin Technology in Smart Grid, Transportation System and Smart City: Challenges and Future, Authors : M. Jafari, A. Kavousi-Fard, T. Chen, M. Karimi
Digital Project Execution – Optimizing Your Assets, Authors : R. Paes, J. Bharthi, J. Butler
The THREAT-ARREST Cyber Range Platform, Authors : G. Hatzivasilis, S. Ioannidis, M. Smyrlis, G. Spanoudakis, F. Frati, C. Braghin, E. Damiani, H. Koshutanski, G. Tsakirakis, T. Hildebrandt, L. Goeke, S. Pape, O. Blinder, M. Vinov, G. Leftheriotis, M. Kunc, F. Oikonomou, G. Magilo, V. Petrarolo, A. Chieti, R. Bordianu
Security and Privacy for Reconfigurable Intelligent Surface in 6G: A Review of Prospective Applications and Challenges, Authors : F. Naeem, M. Ali, G. Kaddoum, C. Huang, C. Yuen
Construction Site Modeling Objects Using Artificial Intelligence and BIM Technology: A Multi-Stage Approach, Authors : S. Dolhopolov, T. Honcharenko, V. Savenko, O. Balina, I. Bezklubenko, T. Liashchenko
Drone-based Risk Management of Autonomous Systems Using Contracts and Blockchain, Authors : F. U. Muram, M. Atif Javed
Digital Twin-Driven Smart Transportation Infrastructure: Connotation, Reference Model, Applications and Research Issues, Authors : Y. Wang, Z. Chen, C. Zhang, H. Hu, Z. Zhang, M. Zhu
The Digital and Cyberspace Modernization Strategy; A Possible Strategical Roadmap to Transform Traditional Military Organizations into a Smart Military through the Emerging Information Technology, Authors : S. Ahmed
Safety and Security of Citizens in Smart Cities, Authors : G. Suciu, I. Hussain, G. Iordache, C. Beceanu, R. A. Kecs, M. -C. Vochin
The Connotation, Characteristics and Development of Digitized Distribution Network: A Review, Authors : Y. Huang, J. Liu, Y. Zhang, B. Zhang, W. Jia
Digital-Twin based Services for advanced Monitoring and Control of future power systems, Authors : A. Kummerow, S. Nicolai, C. Brosinsky, D. Westermann, A. Naumann, M. Richter
Metaverse in Manufacturing Using Emerging Technologies: An Overview For The Smart Industry 4.0, Authors : A. Hussain, A. Athar, T. P. T. Armand, S. Ali, M. A. I. Mozumder, H. -C. Kim
Supply Chain in the Context of 5G Technology Security and Legal Aspects, Authors : S. Qose, R. Zoltán
Distributed Communication and Computation Resource Management for Digital Twin-Aided Edge Computing With Short-Packet Communications, Authors : D. Van Huynh, V. -D. Nguyen, S. R. Khosravirad, G. K. Karagiannidis, T. Q. Duong
Advancements in Fin-Tech and Security Challenges of Banking Industry, Authors : S. Gopal, P. Gupta, A. Minocha
DT-FLDS: DT-enabled Federated Learning Data Sharing Model*, Authors : Y. Cheng, W. Sun, H. Zhang, R. Zhang, X. Zhou
A Study on Self-Security of Smart Inverters, Authors : T. Hossen, B. Mirafzal
A Survey on Goal-Oriented Semantic Communication: Techniques, Challenges, and Future Directions, Authors : T. M. Getu, G. Kaddoum, M. Bennis
Industry 4.0 Technologies for a Data-Driven, Secure, Green and Circular Manufacturing Economy, Authors : A. Z. Md Nuruzzaman Abir
HoneyJudge: A PLC Honeypot Identification Framework Based on Device Memory Testing, Authors : H. Zhu, M. Liu, B. Chen, X. Che, P. Cheng, R. Deng
Industry 4.0 and Beyond: Enabling Digital Transformation and Sustainable Growth in Industry X.0, Authors : P. Onu, A. Pradhan, C. Mbohwa
Development of Emerging Technology-driven NordPlus Competence Network in the Baltic and Nordic Regions, Authors : N. Kunicina, R. Brūzgienė, L. Narbutaite, A. Rassõlkin, M. Ibrahim, S. Balandin
Cybersecurity Impact on the Transport Security, Authors : V. A. Dokuchaev, V. V. Maklachkova
The Convergence of Digital Twin Technology and Personal Healthcare, Authors : Y. -T. Song
Metaverse Security and Privacy: An Overview, Authors : Z. Chen, J. Wu, W. Gan, Z. Qi
The Convergence of Technologies and Standards Across the Electronic Products Manufacturing Industry (SEMI, OSAT, and PCBA) to Realize Smart Manufacturing, Authors : R. Chatterjee, D. Gamota
Multimedia Convergence for Citizens' Well-Being, Authors : A. El Saddik
A Survey on Threat Hunting in Enterprise Networks, Authors : B. Nour, M. Pourzandi, M. Debbabi
Metaverse through Blockchain and Intelligent Networking: A Comprehensive Survey, Authors : M. Alja'afreh, S. Alouneh, M. Obaidat, A. Karime, A. Elsaddik
Virtualized Experiential Learning Platform (VELP) for Smart Grids and Operational Technology Cybersecurity, Authors : M. Manbachi, M. Hammami
ChulaVerse: University Metaverse Service Application Using Open Innovation with Industry Partners, Authors : P. Kruachottiku, G. Phanomchoeng, N. Cooharojananone, K. Kovitanggoon, P. Tea-makorn
Structure and Metrics of Emerging Computing, Authors : A. V. Hacimahmud, H. Khakhanova, I. Hahanov, V. Hahanov, S. Chumachenko, E. Litvinova, O. Shevchenko
A Linear Probabilistic Resilience Model for Securing Critical Infrastructure in Industry 5.0, Authors : K. A. Abuhasel
Providing Heterogeneous Signaling and User Traffic for 5G Core Network Functional Testing, Authors : D. Rivera, J. I. Moreno, M. S. Rodrigo, D. R. López, A. Mozo
An Overview of Cyber-Resilient Smart Inverters Based on Practical Attack Models, Authors : B. Ahn, T. Kim, S. Ahmad, S. K. Mazumder, J. Johnson, H. A. Mantooth, C. Farnell
Simulating Energy and Security Interactions in Semiconductor Manufacturing: Insights from the Intel Minifab Model, Authors : G. A. Weaver, J. Shusko, J. J. Hasenbein, E. Kutanoglu, G. Martinez-Medina, K. K. Castillo-Villar, P. C. G. Costa
Security and Privacy in Metaverse: A Comprehensive Survey, Authors : Y. Huang, Y. J. Li, Z. Cai
Investigating the network traffic of Industry 4.0 applications – methodology and initial results, Authors : G. Soós, D. Ficzere, P. Varga
Energy transition and digitalization: Small modular reactors and smart grids, Authors : H. Housni, N. Majit, N. Amrous, N. Daoudi, M. J. Malzi
Identifying 5G technology enablers in the maritime sector using survey and Twitter data, Authors : N. S. Hadjidimitriou, G. Renzi, M. Apruzzese, G. Perboli, S. Musso
Digital Transformation of Oil & Gas Fields Architecting Multi-Services Digital Private Network on 5G NR-U Model, Authors : A. H. S, A. K. R, B. Gullapalli
Keynote Speaker: The Metaverse: AI-Powered Universe of Persistent Digital Twins, Authors : A. El Saddik
Foreword, Authors : C. Lee
